CF/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.СерийныеНомера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/CommonModules/МаркировкаТоваровГИСМПереопределяемый/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
//
// МаркировкаТоваровГИСМПереопределяемый: серверные переопределяемые процедуры
// и функции работы с документами маркировки товаров подсистемы "Интеграция с ГИСМ".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область МаркировкаТоваров

// Заполняет GTINВСтроках
//
// Параметры:
//  ДокументОбъект - ДокументОбъект. - Документ для заполнения GTIN
//
Процедура ЗаполнитьGTINВСтроках(ДокументОбъект) Экспорт
	
	МаркировкаТоваровГИСМРТ.ЗаполнитьGTINВСтроках(ДокументОбъект);
	
КонецПроцедуры

#Область ОбработчикиСобытийМодуляОбъекта

// Инициализировать документ
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект.* - обрабатываемый документ.
//  ДанныеЗаполнения - Структура - данные заполнения.
//
Процедура ИнициализироватьДокументМаркировкаТоваров(ДокументОбъект, ДанныеЗаполнения = Неопределено) Экспорт
	
	МаркировкаТоваровГИСМРТ.ИнициализироватьДокументМаркировкаТоваров(ДокументОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

// Обработка заполнения маркировка товаров
//
// Параметры:
//  ДанныеЗаполнения	 - Структура - данные заполнения.
//  СтандартнаяОбработка - Булево - стандартная обработка.
//  ДокументОбъект	 - ДокументОбъект.* - обрабатываемый документ.
//
Процедура ОбработкаЗаполненияМаркировкаТоваров(ДанныеЗаполнения, СтандартнаяОбработка, ДокументОбъект) Экспорт
	
	МаркировкаТоваровГИСМРТ.ОбработкаЗаполненияМаркировкаТоваров(ДанныеЗаполнения, СтандартнаяОбработка, ДокументОбъект);
	
КонецПроцедуры

// Обработка проверки заполнения маркировка товаров
//
// Параметры:
//  Отказ							 - Булево - Отказ.
//  ПроверяемыеРеквизиты			 - Массив - массив проверяемых реквизитов.
//  МассивНепроверяемыхРеквизитов	 - Массив - массив непроверяемых реквизитов.
//  ДокументОбъект	 				 - ДокументОбъект.* - обрабатываемый документ.
//
Процедура ОбработкаПроверкиЗаполненияМаркировкаТоваров(Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов, ДокументОбъект) Экспорт
	
	МаркировкаТоваровГИСМРТ.ОбработкаПроверкиЗаполненияМаркировкаТоваров(Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов, ДокументОбъект);
	
КонецПроцедуры

// Перед записью маркировка товаров
//
// Параметры:
//  Отказ							 - Булево - Отказ.
//  РежимЗаписи						 - РежимЗаписи - Режим записи документа.
//  РежимПроведения	 				 - РежимПроведения - Режим проведения документа.
//  ДокументОбъект	 				 - ДокументОбъект.* - обрабатываемый документ.
//
Процедура ПередЗаписьюМаркировкаТоваров(Отказ, РежимЗаписи, РежимПроведения, ДокументОбъект) Экспорт
	
	МаркировкаТоваровГИСМРТ.ПередЗаписьюМаркировкаТоваров(Отказ, РежимЗаписи, РежимПроведения, ДокументОбъект);
	
КонецПроцедуры

// При копировании документа Маркировка товаров.
//
// Параметры:
//  ОбъектКопирования - см. описание параметра в синтаксис-помощнике к обработчику "ПриКопировании".
//  ДокументОбъект - ДокументОбъект.МаркировкаТоваров - обрабатываемый документ.
//
Процедура ПриКопированииМаркировкаТоваров(ОбъектКопирования, ДокументОбъект) Экспорт
	
	МаркировкаТоваровГИСМРТ.ПриКопированииМаркировкаТоваров(ОбъектКопирования, ДокументОбъект);
	
КонецПроцедуры

// Обработка проведения маркировка товаров
//
// Параметры:
//  Отказ			 - Булево - Отказ.
//  РежимПроведения	 				 - РежимПроведения - Режим проведения документа.
//  ДокументОбъект	 				 - ДокументОбъект.* - обрабатываемый документ.
//
Процедура ОбработкаПроведенияМаркировкаТоваров(Отказ, РежимПроведения, ДокументОбъект) Экспорт
	
	МаркировкаТоваровГИСМРТ.ОбработкаПроведенияМаркировкаТоваров(Отказ, РежимПроведения, ДокументОбъект);
	
КонецПроцедуры

// Обработка удаления проведения маркировка товаров
//
// Параметры:
//  Отказ			 - Булево - Отказ.
//  ДокументОбъект	 - ДокументОбъект.* - обрабатываемый документ.
//
Процедура ОбработкаУдаленияПроведенияМаркировкаТоваров(Отказ, ДокументОбъект) Экспорт
	
	МаркировкаТоваровГИСМРТ.ОбработкаУдаленияПроведенияМаркировкаТоваров(Отказ, ДокументОбъект);
	
КонецПроцедуры


// Процедура инициализации данных документа для механизма проведения.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - Ссылка на документ.
//  ДополнительныеСвойства - Структура - Дополнительные свойства для проведения.
//  Регистры - Строка, Структура, Неопределено - список регистров, разделенных запятой, или структура, в ключах которой - имена регистров
//                                                  Если неопределено - то всегда возвращается ИСТИНА
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПеремаркировкаТоваров

#Область ОбработчикиСобытийМодуляОбъекта

// Инициализировать документ
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект.* - обрабатываемый документ.
//  ДанныеЗаполнения - Структура - данные заполнения.
//
Процедура ИнициализироватьДокументПеремаркировкаТоваров(ДокументОбъект, ДанныеЗаполнения = Неопределено) Экспорт
	
	МаркировкаТоваровГИСМРТ.ИнициализироватьДокументПеремаркировкаТоваров(ДокументОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

// Обработка проверки заполнения перемаркировка товаров
//
// Параметры:
//  Отказ							 - Булево - Отказ.
//  ПроверяемыеРеквизиты			 - Массив - массив проверяемых реквизитов.
//  МассивНепроверяемыхРеквизитов	 - Массив - массив непроверяемых реквизитов.
//  ДокументОбъект	 				 - ДокументОбъект.* - обрабатываемый документ.
//
Процедура ОбработкаЗаполненияПеремаркировкаТоваров(ДанныеЗаполнения, СтандартнаяОбработка, ДокументОбъект) Экспорт
	
	МаркировкаТоваровГИСМРТ.ОбработкаЗаполненияПеремаркировкаТоваров(ДанныеЗаполнения, СтандартнаяОбработка, ДокументОбъект);
	
КонецПроцедуры

// Обработка проверки заполнения перемаркировка товаров
//
// Параметры:
//  Отказ							 - Булево - Отказ.
//  ПроверяемыеРеквизиты			 - Массив - массив проверяемых реквизитов.
//  МассивНепроверяемыхРеквизитов	 - Массив - массив непроверяемых реквизитов.
//  ДокументОбъект	 				 - ДокументОбъект.* - обрабатываемый документ.
//
Процедура ОбработкаПроверкиЗаполненияПеремаркировкаТоваров(Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов, ДокументОбъект) Экспорт
	
	МаркировкаТоваровГИСМРТ.ОбработкаПроверкиЗаполненияПеремаркировкаТоваров(Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов, ДокументОбъект);
	
КонецПроцедуры

// Перед записью перемаркировка товаров
//
// Параметры:
//  Отказ							 - Булево - Отказ.
//  РежимЗаписи						 - РежимЗаписи - Режим записи документа.
//  РежимПроведения	 				 - РежимПроведения - Режим проведения документа.
//  ДокументОбъект	 				 - ДокументОбъект.* - обрабатываемый документ.
//
Процедура ПередЗаписьюПеремаркировкаТоваров(Отказ, РежимЗаписи, РежимПроведения, ДокументОбъект) Экспорт
	
	МаркировкаТоваровГИСМРТ.ПередЗаписьюПеремаркировкаТоваров(Отказ, РежимЗаписи, РежимПроведения, ДокументОбъект);
	
КонецПроцедуры

// При копировании документа Перемаркировка товаров.
//
// Параметры:
//  ОбъектКопирования - см. описание параметра в синтаксис-помощнике к обработчику "ПриКопировании".
//  ДокументОбъект - ДокументОбъект.ПеремаркировкаТоваров - обрабатываемый документ.
//
Процедура ПриКопированииПеремаркировкаТоваров(ОбъектКопирования, ДокументОбъект) Экспорт
	
	МаркировкаТоваровГИСМРТ.ПриКопированииПеремаркировкаТоваров(ОбъектКопирования, ДокументОбъект);
	
КонецПроцедуры

// Обработка проведения перемаркировка товаров
//
// Параметры:
//  Отказ			 - Булево - Отказ.
//  РежимПроведения	 - РежимПроведения - Режим проведения документа.
//  ДокументОбъект	 - ДокументОбъект.* - обрабатываемый документ.
//
Процедура ОбработкаПроведенияПеремаркировкаТоваров(Отказ, РежимПроведения, ДокументОбъект) Экспорт
	
	МаркировкаТоваровГИСМРТ.ОбработкаПроведенияПеремаркировкаТоваров(Отказ, РежимПроведения, ДокументОбъект);
	
КонецПроцедуры

// Обработка удаления проведения перемаркировка товаров
//
// Параметры:
//  Отказ			 - Булево - Отказ.
//  ДокументОбъект	 - ДокументОбъект.* - обрабатываемый документ.
//
Процедура ОбработкаУдаленияПроведенияПеремаркировкаТоваров(Отказ, ДокументОбъект) Экспорт
	
	МаркировкаТоваровГИСМРТ.ОбработкаУдаленияПроведенияПеремаркировкаТоваров(Отказ, ДокументОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПроцедурыИФункцииФормыДокумента

// Заполняет номенклатуру КиЗ в строке документа
//
// Параметры:
//  ТекущаяСтрока				 - ТекущаяСтрока - текущая строка таблицы Товары.
//  СписокНоменклатураКиЗ		 - СписокЗначений - список номенклатуры КиЗ, подходящих под выбранную категорию КиЗ в документе.
//  КиЗГИСМСИндивидуализацией	 - Булево - Признак получения КиЗ по GTIN или без GTIN.
//
Процедура ЗаполнитьНоменклатуруКиЗВСтроке(ТекущаяСтрока, СписокНоменклатураКиЗ, КиЗГИСМСИндивидуализацией) Экспорт
	
	МаркировкаТоваровГИСМРТ.ЗаполнитьНоменклатуруКиЗВСтроке(
		ТекущаяСтрока,
		СписокНоменклатураКиЗ,
		КиЗГИСМСИндивидуализацией);
	
КонецПроцедуры

// Заполняет GTIN в строке документа
//
// Параметры:
//  ТекущаяСтрока				 - ТекущаяСтрока - текущая строка таблицы Товары.
//
Процедура ЗаполнитьGTINВСтроке(ТекущаяСтрока) Экспорт
	Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Штрихкоды.Владелец КАК Номенклатура,
		|	Штрихкоды.Характеристика КАК Характеристика,
		|	Штрихкоды.Штрихкод КАК GTIN
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Владелец = &Номенклатура
		|	И ВЫБОР
		|		КОГДА &ХарактеристикаЗаполнена ТОГДА
		|			Штрихкоды.Характеристика = &Характеристика
		|		ИНАЧЕ
		|			ИСТИНА
		|	КОНЕЦ";
	Запрос.УстановитьПараметр("Номенклатура", ТекущаяСтрока.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", ТекущаяСтрока.Характеристика);
	Запрос.УстановитьПараметр("ХарактеристикаЗаполнена", ЗначениеЗаполнено(ТекущаяСтрока.Характеристика));
	ТаблицаGTIN = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаGTIN.Количество() = 1 Тогда
		СтрокаТаблицы = ТаблицаGTIN.Получить(0);
		ТекущаяСтрока.GTIN = СтрокаТаблицы.GTIN;
	ИначеЕсли ТаблицаGTIN.Найти(ТекущаяСтрока.GTIN, "GTIN") <> Неопределено Тогда
		// ничего не делаем, GTIN подходит
	Иначе
		ТекущаяСтрока.GTIN = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет номенклатуру КиЗ в строках документа
//
// Параметры:
//  Объект				 		 - ДокументОбъект.* - текущая строка таблицы Товары.
//  СписокНоменклатураКиЗ		 - СписокЗначений - список номенклатуры КиЗ, подходящих под выбранную категорию КиЗ в документе.
//  ЗаполнятьСерии				 - Булево - Признак заполнения серий в ТЧ Серии.
//
Процедура ЗаполнитьНоменклатуруКиЗВСтроках(Объект, СписокНоменклатураКиЗ, ЗаполнятьСерии = Истина) Экспорт
	
	МаркировкаТоваровГИСМРТ.ЗаполнитьНоменклатуруКиЗВСтроках(
		Объект,
		СписокНоменклатураКиЗ,
		ЗаполнятьСерии);
	
КонецПроцедуры

// Заполняет список КиЗ, подходящих для заполнения документ по выбранным категориям КиЗ.
//
// Параметры:
//  Объект				 		 - ДокументОбъект.* - текущая строка таблицы Товары.
//  СписокНоменклатураКиЗ		 - СписокЗначений - список номенклатуры КиЗ, подходящих под выбранную категорию КиЗ в документе.
//
Процедура ПолучитьКиЗДляЗаполнения(Объект, СписокНоменклатураКиЗ) Экспорт
	
	МаркировкаТоваровГИСМРТ.ПолучитьКиЗДляЗаполнения(
		Объект,
		СписокНоменклатураКиЗ);
	
КонецПроцедуры

// Заполняет списки выбора реквизитов шапки.
//
// Параметры:
//  Форма	 - УправляемаяФорма - форма документа
//
Процедура ЗаполнитьСпискиВыбораРеквизитовШапки(Форма) Экспорт
	
	МаркировкаТоваровГИСМРТ.ЗаполнитьСпискиВыбораРеквизитовШапки(Форма);
	
КонецПроцедуры

// Заполняет списки выбора реквизитов шапки.
//
// Параметры:
//  Форма	 - УправляемаяФорма - форма документа
//
Процедура ЗаполнитьСпискиВыбораРеквизитовШапкиПеремаркировкаТоваров(Форма) Экспорт
	
	МаркировкаТоваровГИСМРТ.ЗаполнитьСпискиВыбораРеквизитовШапкиПеремаркировкаТоваров(Форма);
	
КонецПроцедуры

// Обработчик Категория КиЗ при изменении
//
// Параметры:
//  ДокументОбъект			 - ДокументОбъект.* - обрабатываемый документ.
//  СписокНоменклатураКиЗ	 - СписокЗначений - список номенклатуры КиЗ, подходящих под выбранную категорию КиЗ в документе.
//  ЗаполнятьСерии			 - Булево - Признак заполнения серий в ТЧ Серии.
//
Процедура КатегорияКиЗПриИзменении(ДокументОбъект, СписокНоменклатураКиЗ, ЗаполнятьСерии = Истина) Экспорт
	
	МаркировкаТоваровГИСМРТ.КатегорияКиЗПриИзменении(ДокументОбъект, СписокНоменклатураКиЗ, ЗаполнятьСерии);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
